"""

Умова: Напишіть програму, яка отримує довжини двох катетів прямокутного 
трикутника та виводить його площу. Користувач вводить довжини катетів у окремих 
рядках.

Вхідні дані: 2 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести площу трикутника на екран.
""" 
#В программі користувач вводить 2 числа ,після чого виводить на екран площу прямоткутникого трикутника с катетами данного розміра.
#Конструкція try-except перевіряє на правильність тип введеної користувачем інформації.
try:
    a = float(input("Введіть першу сторону "))
    b = float(input("Введіть другу сторону "))
    с = 0.5*a*b
    print("Площа трикутника %f" % с)
except TypeError :
    print("Ви ввели не число")  
