"""

Умова: Напишіть програму, яка отримує три числа і друкує їх суму. Кожне число 
користувач вводить у окремому рядку.

Вхідні дані: 3 дійсних числа.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: вивести суму трьох чисел на екран.
"""
#В программі користувач вводить 3 числа ,після чого виводить на екран результат їх додавання.
#Конструкція try-except перевіряє на правильність тип введеної користувачем інформації.
try:
    a = float(input("Введіть перше число "))
    b = float(input("Введіть друге число "))
    c = float(input("Введіть третє число "))
    sum = a+b+c 
    print("Результат додавання %f" % sum)
except TypeError :
    print("Ви ввели не число")  
