
"""
Умова: Школа вирішила сформувати три нові групи учнів та надати їм окремі класи. У кожному класі необхідно встановити столи для учнів, у розрахунку, що за одним столом може сидіти не більше двох учнів. Яку мінімальну кількість столів необхідно придбати?

Вхідні дані: 3 цілих числа - кількість учнів у кожній групі.  Кожне число користувач вводить в окремому рядку.

Вихідні дані: число - кількість столів
"""
#Програма обчислює кількість столів необхідну для учнів
#Конструкція try-except перевіряє на правильність тип введеної користувачем інформації.

try:
    k1 = abs(int(input("Введіть кількість учнів в 1 групі ")))
    k2 = abs(int(input("Введіть кількість учнів в 2 групі ")))
    k3 = abs(int(input("Введіть кількість учнів в 3 групі ")))
    count = 0
    if(k1/2 == k1//2):
        count += k1//2
    else:
        count = count +1 + k1//2
    if(k2/2 == k2//2):
        count += k2//2
    else:
        count = count +1 + k2//2
    if(k3/2 == k3//2):
        count += k3//2
    else:
        count = count +1 + k3//2
    print("Кількість столів %d" % count)
except ValueError:
    print("Введене значення не є числом") 
